OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/incompressible/pimpleFoam/laminar/movingCone/system/cuttingPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

cuttingPlane
{
    type            surfaces;
    libs            ("libsampling.so");

    writeControl    writeTime;

    surfaceFormat   vtk;

    fields          ( p U );

    interpolationScheme cellPoint;

    surfaces
    (
        zNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            point           (0 0 0);
            normal          (0 0 1);
            interpolate     true;
        }
    );
}


// ************************************************************************* //
